// Задание 1
// const userAnswer = prompt('Введите температуру по Цельсию: ');
// let fareng = userAnswer * 1.8 + 32;
// console.log('Температура по Фаренгейту: ' + fareng);

// Задание 2
// var name = '"Василий"';
// alert(admin = name);

// Задание 3
// var a = 1000;
// var b = '108';
// c = a + b;
// console.log(c);

// Задание 4
// Поддержка атрибута async появилась в HTML5, он разрешает браузеру загружать js-файлы параллельно и выполнять сразу после загрузки, не дожидаясь обработки остальной части страницы.
// Атрибут defer позволяет браузеру начать загрузку js-файлов параллельно, не останавливая дальнейшую обработку страницы. Их выполнение происходит после полного разбора объектной модель документа (от англ. Document Object Model, сокращенно DOM), при этом браузер гарантирует последовательность на основе порядка подключения файлов.


